MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A1AB3CNE/mcu.h
/* ========================================================  AESMOD  ========================================================= */
 #define R_AES_AESMOD_WRRQEN_Pos      (9UL)          /*!< WRRQEN (Bit 9)                                        */
 #define R_AES_AESMOD_WRRQEN_Msk      (0x200UL)      /*!< WRRQEN (Bitfield-Mask: 0x01)                          */
 #define R_AES_AESMOD_RDRQEN_Pos      (8UL)          /*!< RDRQEN (Bit 8)                                        */
 #define R_AES_AESMOD_RDRQEN_Msk      (0x100UL)      /*!< RDRQEN (Bitfield-Mask: 0x01)                          */
 #define R_AES_AESMOD_MODEN_Pos       (0UL)          /*!< MODEN (Bit 0)                                         */
 #define R_AES_AESMOD_MODEN_Msk       (0x1UL)        /*!< MODEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  AESCMD  ========================================================= */
 #define R_AES_AESCMD_ILOP_Pos        (31UL)         /*!< ILOP (Bit 31)                                         */
 #define R_AES_AESCMD_ILOP_Msk        (0x80000000UL) /*!< ILOP (Bitfield-Mask: 0x01)                            */
 #define R_AES_AESCMD_KWRDY1_Pos      (30UL)         /*!< KWRDY1 (Bit 30)                                       */
 #define R_AES_AESCMD_KWRDY1_Msk      (0x40000000UL) /*!< KWRDY1 (Bitfield-Mask: 0x01)                          */
 #define R_AES_AESCMD_KWRDY0_Pos      (29UL)         /*!< KWRDY0 (Bit 29)                                       */
 #define R_AES_AESCMD_KWRDY0_Msk      (0x20000000UL) /*!< KWRDY0 (Bitfield-Mask: 0x01)                          */
 #define R_AES_AESCMD_IRRDY_Pos       (28UL)         /*!< IRRDY (Bit 28)                                        */
 #define R_AES_AESCMD_IRRDY_Msk       (0x10000000UL) /*!< IRRDY (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_IWRDY_Pos       (27UL)         /*!< IWRDY (Bit 27)                                        */
 #define R_AES_AESCMD_IWRDY_Msk       (0x8000000UL)  /*!< IWRDY (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_CWRDY_Pos       (26UL)         /*!< CWRDY (Bit 26)                                        */
 #define R_AES_AESCMD_CWRDY_Msk       (0x4000000UL)  /*!< CWRDY (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_DRRDY_Pos       (25UL)         /*!< DRRDY (Bit 25)                                        */
 #define R_AES_AESCMD_DRRDY_Msk       (0x2000000UL)  /*!< DRRDY (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_DWRDY_Pos       (24UL)         /*!< DWRDY (Bit 24)                                        */
 #define R_AES_AESCMD_DWRDY_Msk       (0x1000000UL)  /*!< DWRDY (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_KEYSEL_Pos      (12UL)         /*!< KEYSEL (Bit 12)                                       */
 #define R_AES_AESCMD_KEYSEL_Msk      (0x1000UL)     /*!< KEYSEL (Bitfield-Mask: 0x01)                          */
 #define R_AES_AESCMD_STORESEL_Pos    (8UL)          /*!< STORESEL (Bit 8)                                      */
 #define R_AES_AESCMD_STORESEL_Msk    (0x300UL)      /*!< STORESEL (Bitfield-Mask: 0x03)                        */
 #define R_AES_AESCMD_CHAIN_Pos       (4UL)          /*!< CHAIN (Bit 4)                                         */
 #define R_AES_AESCMD_CHAIN_Msk       (0x30UL)       /*!< CHAIN (Bitfield-Mask: 0x03)                           */
 #define R_AES_AESCMD_KEYLN_Pos       (1UL)          /*!< KEYLN (Bit 1)                                         */
 #define R_AES_AESCMD_KEYLN_Msk       (0x2UL)        /*!< KEYLN (Bitfield-Mask: 0x01)                           */
 #define R_AES_AESCMD_INVCIP_Pos      (0UL)          /*!< INVCIP (Bit 0)                                        */
 #define R_AES_AESCMD_INVCIP_Msk      (0x1UL)        /*!< INVCIP (Bitfield-Mask: 0x01)                          */
/* =========================================================  AESDW  ========================================================= */
/* ========================================================  AESIVW  ========================================================= */
/* ========================================================  AESKW0  ========================================================= */
/* ========================================================  AESKW1  ========================================================= */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA2A1AB_H */

/** @} */ /* End of group R7FA2A1AB */

/** @} */ /* End of group Renesas */
